Repository: 84000/data-translation-memory
Catalog: toh232-v4.tmx
Source language: bo
Languages: en

source: དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་ཡེ་ཤེས་སྣང་བའི་མར་མེ་གསལ་བར་བྱ་བའི་དོན་དང་།
en: It is for the sake of shining the lamplight of the gnosis of the Tathāgata’s permanence, eternality, constancy, and tranquility.

source: དེ་བཞིན་གཤེགས་པའི་རྟག་པ་དང་། བརྟན་པ་དང་། ཐེར་ཟུག་པའི་དེ་ཁོ་ན་མཁྱེན་པའི་ཟླ་བ་དང་ཉི་མའི་འོད་བསྐྱེད་པའི་དོན་དང་།
en: It is for the sake of bringing forth the moon rays and sun rays of the knowledge of the reality of the Tathāgata’s permanence, eternality, constancy, and tranquility.

source: ཤེས་རབ་ཀྱི་རྟག་པའི་མིག་སྤེལ་བར་བྱ་བའི་དོན་དང་།
en: It is for the sake of increasing the permanent eye of wisdom.

source: མཚུངས་པ་མེད་པའི་ཚུལ་ཐོབ་པར་བྱ་བའི་དོན་དང་།
en: “It is for the sake of bringing about the attainment of unparalleled conduct.

source: གཟུངས་དང་། ཏིང་ངེ་འཛིན་གྱི་རྫས་ཀྱི་ལྟད་མོ་བསྟན་པའི་དོན་དང་།
en: It is for the sake of exhibiting the substance of dhāraṇī and samādhi.

source: དེ་བཞིན་གཤེགས་པའི་གཞུང་ལུགས་ཀྱི་འཕགས་པའི་ནོར་ཐོབ་པར་བྱ་བའི་དོན་དང་།
en: It is for the sake of engendering the attainment of the exalted jewel of the scriptural tradition of the tathāgatas.

source: དེ་བཞིན་གཤེགས་པའི་སྐུའི་ཡང་དག་པའི་མེ་ལོང་གི་དཀྱིལ་འཁོར་ལེགས་པར་མཐོང་བར་བྱ་བའི་དོན་དང་།
en: It is for the sake of generating an excellent vision of the authentic mirror-like domain of the Tathāgata’s body.

source: དེ་བཞིན་གཤེགས་པ་ཡོངས་སུ་མྱ་ངན་ལས་འདའོ་སྙམ་པའི་མ་རིག་པའི་དྲ་བའི་སྒོ་ངའི་སྦུབས་བརྟོལ་བའི་དོན་དང་།
en: It is for the sake of breaking open the eggshell of ignorance of thinking that ‘the Tathāgata has completely passed into parinirvāṇa.’

source: དེ་བཞིན་གཤེགས་པའི་བསྟན་པ་ནུབ་པར་འགྱུར་རོ་སྙམ་པའི་མ་རིག་པའི་རྒྱ་མཚོ་ཆེན་པོར་གྲུ་ཞིག་པའི་སེམས་ཅན་རྣམས་ཀྱི་གྲུ་བཅོས་པའི་དོན་དང་།
en: It is for the sake of building a boat for those sentient beings who are shipwrecked in the great ocean of ignorance, thinking that ‘the Tathāgata’s teachings will disappear.’

source: དེ་བཞིན་གཤེགས་པ་ནི་མི་རྟག་གོ། །ཐེར་ཟུག་མ་ཡིན་ནོ། །མི་བརྟན་ནོ། །ཞི་བ་མ་ཡིན་ནོ་སྙམ་པའི་དུག་གིས་ཕོག་པའི་ལྟ་བའི་ཟུག་རྔུ་དབྱུང་ཞིང་གསོ་བའི་ཆོ་ག་ཆེན་པོ་ཡོངས་སུ་གཟུང་བའི་དོན་དང་། དེ་བཞིན་གཤེགས་པ་ཐེར་ཟུག་མ་ཡིན། ཞི་བ་མ་ཡིན། བརྟན་པ་མ་ཡིན། རྟག་པ་མ་ཡིན་ནོ་
en: It is for the sake of upholding the great healing technique and extracting the arrow of the view of those who have been struck by the poison of the thought that ‘the Tathāgata is impermanent, not eternal, not constant, and not at peace.’

source: སྙམ་པས་སེམས་ཡོངས་སུ་རྨོངས་པར་བྱས་ཤིང་རྣམ་པར་འཁྲུལ་བར་བྱས་པའི་མཁྲིས་པ་ཞི་བར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པ་རྣམས་ཕྱོགས་གཅིག་ཏུ་བཞུགས་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་འབེལ་བའི་གཏམ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་ཐར་པའི་གསང་བའི་ཆོས་སྟོན་པའི་ཚུལ་རྣམ་པ་སྣ་ཚོགས་ཀྱི་རྩེད་མོས་རྣམ་པར་རོལ་ཏེ
en: “In order to ease the jaundice caused by the complete confusion and thorough ignorance of thinking that ‘the Tathāgata is not eternal, not tranquil, not constant, and not permanent,’ all the tathāgatas together display their prolific speech by variously performing the conduct of teaching the secret Dharma of inconceivable complete liberation;

source: རྣམ་པ་སྣ་ཚོགས་ཀྱི་ཚུལ་གྱིས་མངོན་པར་གནས་ཤིང་ཡང་དག་པར་ཞུགས་ཏེ་འབེལ་བའི་གཏམ་མཛད་དོ། །
en: through these various sorts of conduct, they manifestly abide and correctly engage in prolific speech.

source: འབེལ་བའི་གཏམ་ནི་མཚན་ཉིད་དེ་ལྟ་བུར་ཕྲ་བའི་ཚིག་དང་ཤིན་ཏུ་རྟོགས་པར་དཀའ་བ་དང་། ཤིན་ཏུ་བྱང་བ་དང་། ཤིན་ཏུ་ཟབ་པས་བརྒྱན་པ་ཡིན་ཏེ།
en: The words of their prolific speech, having such subtle characteristics, are extremely difficult to understand, extremely skilled, and adorned with extreme profundity.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་ཀྱིས་སྔོན་ཚིག་དང་། ཡི་གེ་གཅིག་ཀྱང་མ་ཐོས་ཤིང་ཡུལ་དུ་མ་གྱུར་པ་ཞུ་བ་ལུང་བསྟན་པའི་ཕྱིར་དམ་བཅས་ཤིང་སྨོན་ལམ་བཏབ་པ་ལེགས་སོ་ལེགས་སོ། །
en: “Great Cloud Essence, you have made this vow and aspiration to request authoritative explanations in response to your questions regarding the Tathāgata’s previous speeches, of which all śrāvakas and pratyekabuddhas have not heard even a single word or syllable and were not even aware. Excellent, excellent!

source: སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བའི་བདུད་རྩི་མི་ཟད་པའི་རིན་པོ་ཆེའི་གཏེར་དེ་བཞིན་གཤེགས་པ་ལ་དྲིས་པ་ཤིན་ཏུ་ལེགས་པ་བྱས་སོ། །
en: It is extremely excellent that you have asked the Tathāgata about the inexhaustible treasury of nectar that benefits and pleases all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདུད་རྩི་མཚུངས་པ་མེད་པའི་མདོའི་རྒྱལ་པོའི་གཏེར་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡེ་ཤེས་ཀྱི་གཏེར་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཀྱི་གཏེར་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་ཡང་དག་པའི་ཡེ་ཤེས་ཀྱི་ལྟ་བ་བཟང་པོའི་གཏེར་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་དེ་ཁོ་ན་ཉིད་ཀྱི་ཡོན་ཏན་རྟག་པའི་རང་བཞིན་གྱི་གཏེར་བཙུགས་ཏེ་ཤིན་ཏུ་བརྟན་པར་བྱས་པ་ཡིན་ནོ། །
en: You have established and greatly stabilized the treasury of the kingly discourse of the unparalleled nectar of all sentient beings, the treasury of the gnosis of all tathāgatas, the treasury of the greatness of the qualities of all tathāgatas, the treasury of the excellent view of the authentic gnosis of the permanence, eternality, constancy, and tranquility of all tathāgatas, the treasury of the permanent nature of the qualities of the reality of all the tathāgatas.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་དང་འཚམ་ཞིང་རྐྱེན་དུ་བབ་པར་དམ་བཅས་ཤིང་སྨོན་ལམ་བཏབ་པ་ནི་ལེགས་ཏེ།
en: Great Cloud Essence, this vow and aspiration, which suits you, comes about from prior causes.

source: དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱང་རྗེས་སུ་ཡི་རང་བ་མཛད་དོ། །
en: It is excellent, causing all the tathāgatas to rejoice.”

source: དེ་སྐད་ཅེས་བཀའ་སྩལ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོས་བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: When this reply had been given, the bodhisattva mahāsattva Great Cloud Essence addressed the Bhagavān, saying,

source: བཅོམ་ལྡན་འདས་བདག་གིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་དམ་བཅས་ཤིང་སྨོན་ལམ་བཏབ་པ་མ་ལགས་ཀྱི།
en: “Bhagavān, in fact, it is not that I have made such a vow and aspiration to request authoritative explanations from all the tathāgata, foe-destroyer, complete and perfect buddhas.

source: བཅོམ་ལྡན་འདས་བདག་གིས་ནི་དེ་བཞིན་གཤེགས་པའི་མཐུས་སེམས་ཅན་ཐམས་ཅད་བསོད་ནམས་སོགས་པར་བགྱི་བའི་སླད་དུ། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་ལ་ཞུ་བ་ལུང་བསྟན་པའི་སླད་དུ་མཚུངས་པ་མ་མཆིས་པའི་མདོའི་རྒྱལ་པོའི་གཏེར་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་མི་ཟད་པའི་གཏེར་གྱི་དམ་བཅས་ཤིང་སྨོན་ལམ་བཏབ་པ་ལགས་སོ། །
en: Bhagavān, it is through the power of the Tathāgata that, in order to accumulate merit for all sentient beings, I have made the vow and aspiration to request authoritative explanations in response to my questions concerning the treasury of the unparalleled kingly discourse and the inexhaustible treasury of all sentient beings.

source: དམུས་ལོང་ལྟ་བུའི་སེམས་ཅན་རྣམས་ཀྱི་ཡེ་ཤེས་ཀྱི་མིག་གི་མར་མེ་བཅོམ་ལྡན་འདས་ཀྱིས་བསྟན་དུ་གསོལ།
en: May the Bhagavān light the lamp of the gnosis-eye of all blind sentient beings!

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཤེས་རབ་ཀྱི་གཏེར་བཅོམ་ལྡན་འདས་ཀྱིས་བཤད་དུ་གསོལ།
en: May the Bhagavān set forth the treasury of wisdom of all sentient beings!

source: སེམས་ཅན་ཐམས་ཅད་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བ་དང་། དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་གནས་པར་མཛད་དུ་གསོལ།། །།
en: May the Bhagavān establish the steadfast treasury of the sacred Dharma and the permanent, eternal, constant, and peaceful tathāgata-qualities of all sentient beings!”

source: དེ་སྐད་ཅེས་གསོལ་ནས་བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་སྤྲིན་ཆེན་སྙིང་པོ་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: At this point, having been entreated in this fashion, the Bhagavān replied to the bodhisattva mahāsattva Great Cloud Essence,

source: སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་ཀྱིས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ལ་ཁྱོད་དང་འཚམ་པའི་ཚིག་གི་དོན་ཕྲ་ཞིང་ཟབ་མོའི་ཚིག་དང་། ཡི་གེ་སྤེལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པའི་མཚན་ཉིད་དང་། དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་དང་། ཁྱོད་དང་འདྲ་བ་དག་གིས་མཚུངས་པ་མེད་པའི་མདོའི་རྒྱལ་པོའི་གཏེར་དང་། དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བདུད་རྩི་མི་ཟད་པའི་གཏེར་དེ་བཞིན་གཤེགས་པ་ལ་ཞུས་པ་ལེགས་ཏེ་
en: It is indeed excellent, Great Cloud Essence, that you have addressed such subtle and profound words and syllables to the tathāgata, foe-destroyer, complete and perfect buddhas, and that you have questioned the Tathāgata regarding the steadfast treasury of the sacred Dharma and the permanent characteristic of the greatness of the tathāgata qualities of all sentient beings, the treasury of the kingly discourse that is unparalleled by all those like you, the steadfast treasury of the sacred Dharma, and the inexhaustible treasury of the nectar of all sentient beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་གཏེར་བརྟན་པར་བཞག་པ་ངས་བཤད་པར་བྱའོ། །
en: I will explain how this treasury of all sentient beings has been firmly established.

source: སྤྲིན་ཆེན་སྙིང་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཡང་དག་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་གྱི་ཚུལ་དེ་ལེགས་པར་རབ་ཏུ་ཉོན་ལ་ཤིན་ཏུ་ཡིད་ལ་ཟུང་ཤིག་དང་། བསྟན་པར་བྱ་སྟེ
en: “Great Cloud Essence, listen well and remember fully as I teach about that steadfast treasury of the sacred Dharma of the greatness of the perfect buddha qualities of all the tathāgata, foe-destroyer, complete and perfect buddhas.

source: སྤྲིན་ཆེན་སྙིང་པོ་གཞན་ཡིད་ལ་མ་སེམས་ཤིག་དང་བཤད་པར་བྱའོ། །
en: Do not think of anything else, Great Cloud Essence, and I will explain it to you.

source: སྤྲིན་ཆེན་སྙིང་པོ་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་པ་དང་། བདེ་བ་དང་། སྙིང་བརྩེ་བའི་ཕྱིར་བརྟན་པའི་སེམས་ཀྱིས་ཟུང་ཤིག །སེམས་ཅན་ཐམས་ཅད་ངེས་པར་བསྒྲལ་བའི་སེམས་ཀྱིས་ཡིད་ལ་ཟུང་ཤིག །
en: Great Cloud Essence, in order to benefit, please, and show love for all sentient beings, you should retain these words with a stable mind and remember them with a mind devoted to liberating all these sentient beings.

source: སྤྲིན་ཆེན་སྙིང་པོ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རྣམས་ཀྱི་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཀྱི་ཆོས་བརྟན་པའི་གཏེར་གྱི་ཚུལ་གང་གིས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་གྱི་ཚུལ་དང་།
en: “Great Cloud Essence, this is the steadfast treasury of the sacred Dharma of the greatness of the buddha qualities of the tathāgata, foe-destroyer, complete and perfect buddhas.

source: དེ་ཁོ་ན་ཤེས་པའི་ཆུས་ཡོངས་སུ་སྨིན་པར་བྱས་པའི་དགེ་བའི་རྩ་བའི་བདུད་རྩིའི་རོ་ཞིམ་པོ་ཐོབ་པ་ཡོད་དེདགེ་བའི་རྩ་བ་དེས་བདུད་རྩིའི་རོ་ཞིམ་པོ་དེ་ཡོངས་སུ་སྤྱད་ནས་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་མཛད་པ་ཐམས་ཅད་མཛད་དེ།
en: Whoever obtains the sweet nectar of the virtuous roots that are completely ripened by the water of the gnosis of the conduct and reality of the steadfast treasury of the sacred Dharma of the Buddha’s qualities will, having deeply enjoyed its sweet taste due to their virtuous roots, perform all the activities of all the tathāgatas.

source: དེ་ཡོངས་སུ་རྫོགས་པས་སངས་རྒྱས་ཀྱི་མཛད་པས་མངོན་པར་རོལ་པ་བདུད་རྩིའི་རོ་ཞིམ་པོ་དེ་ཡོངས་སུ་སྤྱོད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ལ་ཡང་ཡེ་ཤེས་ཆེན་པོའི་བདུད་རྩིའི་རོ་ཞིམ་པོ་བྱིན་ཅིག །
en: You should truly imbibe the sweet-tasting nectar that is displayed through the activities of the complete and perfect buddhas; moreover, you should bestow that sweet-tasting nectar of great gnosis on all sentient beings.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་མཚུངས་པ་མེད་པའི་མདོའི་རྒྱལ་པོ། ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ། ཚངས་པར་སྤྱོད་པ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ། ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ། ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་ཟུང་ཤིག །སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་མཚུངས་པ་མེད་པའི་མདོའི་རྒྱལ་པོའི་ཆོས་ཀྱི་རྣམ་གྲངས་ཆེན་པོ་དེ་བཞིན་གཤེགས་པའི་ཚུལ་དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་ཤོད་ཅིག །
en: You should uphold the great Dharma discourses, the pure conduct, the goodness spanning beginning, middle, and end, the excellent composition, the unique qualities, the perfection, the complete purity, and the complete refinement of this Great Cloud Essence discourse, the unparalleled king of sūtras. “Great Cloud Essence, you should explain the steadfast treasury of the sacred Dharma of the conduct of the tathāgatas, the great Dharma discourses in The Great Cloud, the unparalleled king of discourses.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ཀུན་ཆུབ་པར་གྱིས་ཤིག །
en: Great Cloud Essence, you should fully understand this Great Cloud discourse.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོའི་གཟུངས་ཀྱི་རྒྱ་མཚོ་ཆེན་པོ་ཏིང་ངེ་འཛིན་གྱི་རྒྱ་མཚོ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཡོན་ཏན་གྱི་འབྱུང་གནས་ཀྱི་ཚོང་རྡལ་སྐྱེས་བུ་དམ་པའི་ཚོང་པའི་གནས་ཆེན་པོར་གྱུར་པ་རྒྱས་པར་གྱིས་ཤིག །
en: Great Cloud Essence, you should broadly expound the greatness of the vast ocean of dhāraṇī of The Great Cloud, which is an ocean of samādhi, a trading town that is the source of the greatness of the Tathāgata’s qualities, a bazaar of virtuous beings.

source: སྤྲིན་ཆེན་སྙིང་པོ་དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཐམས་ཅད་ཀྱི་གསང་བ་བསམ་གྱིས་མི་ཁྱབ་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་དགེ་བའི་རྩ་བའི་འབྱུང་གནས་ཟབ་མོའི་ཚིག་གི་དོན་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་རང་བཞིན་གྱི་ཕྱག་རྒྱའི་མཚན་ཉིད་བརྟན་པའི་མངོན་མཚན་གྱིས་བཏབ་པ་སྤྲིན་ཆེན་པོའི་མདོ་མཚུངས་པ་མེད་པའི་མདོའི་རྒྱལ་པོའི་ཆོས་ཀྱི་ཚུལ་ཟུང་ཤིག །
en: “Great Cloud Essence, you should maintain the conduct of the teachings of the unparalleled king of discourses, The Great Cloud, in which—through the clarity of its profound words that demonstrate the enduring characteristics that are sealed by the nature of permanence, eternality, constancy, and tranquility—the virtuous roots of the king of the magical manifestation of all the inconceivable secret samādhi and dhāraṇī of the greatness of the Tathāgata’s qualities have been planted.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཤིན་ཏུ་བྱང་ཞིང་ཤིན་ཏུ་རྟོགས་པར་དཀའ་བ་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་རང་བཞིན་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་ཀྱི་སྤྲིན་ཆེན་པོའི་མདོ་མཚུངས་པ་མེད་པའི་མདོའི་རྒྱལ་པོ་དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་ལ་ཡིད་ཆེས་པར་གྱིས་ཤིག །
en: Great Cloud Essence, you should trust in the steadfast treasury of the sacred Dharma of the unparalleled king of discourses, The Great Cloud, the greatness of buddha qualities that have the nature of permanence, eternality, constancy, and tranquility, and which are extremely pure and difficult to understand.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་དང་།
en: “Great Cloud Essence, The Great Cloud is the steadfast treasury of the sacred Dharma of all sentient beings.

source: མུ་གེ་བྱུང་བའི་ཚེ་ལོངས་སྤྱོད་མི་ཟད་པར་བྱེད་པའི་ཏིང་ངེ་འཛིན་དང་གཟུངས་ཀྱི་གཏེར་དང་།
en: It is the treasury of samādhi and dhāraṇī that produces inexhaustible enjoyments during times of famine.

source: ཆར་མི་འབབ་པའི་ཚེ་དམ་པའི་ཆོས་ཀྱི་ཏིང་ངེ་འཛིན་གྱི་གཏེར་མི་ཟད་པའི་བདུད་རྩིའི་ཆར་གྱི་ཆུས་གང་བའི་སྤྲིན་ཆེན་པོའི་ཡོན་ཏན་གྱི་རྣམ་པར་འཕྲུལ་པ་དང་།
en: During times of drought, it miraculously emanates a great cloud with virtuous qualities that fills the treasury of samādhi of the constant sacred Dharma with a rain of inexhaustible nectar.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་རང་བཞིན་གྱི་ཆར་ཆེན་པོ་དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་དང་།
en: It is the steadfast treasury of the sacred Dharma, the great rain of the permanent, eternal, constant, tranquil nature of the greatness of the Tathāgata’s qualities.

source: ནད་བྱུང་བའི་ཚེ་བདེ་ཞིང་བསིལ་བའི་སྨན་སྦྱར་བས་དུག་གི་མཐུ་ཐམས་ཅད་མེད་པར་བྱེད་པ་དང་།
en: During times of plague, it completely nullifies the power of all poisonous forces with its pleasing, cooling medicine.

source: དམ་པའི་ཆོས་ཀྱི་གཟུངས་འཐོབ་པའི་ཏིང་ངེ་འཛིན་རྟག་པ་དང་། ཐེར་ཟུག་པ་དང་། བརྟན་པ་དང་། ཞི་བའི་རང་བཞིན་གྱི་དེ་བཞིན་གཤེགས་པའི་ངོ་བོ་ཉིད་ཡོན་ཏན་གྱི་ཚོགས་ལ་བསྙེན་བཀུར་བྱ་བའི་གནས་དང་།
en: It is the samādhi that obtains the dhāraṇī of the sacred Dharma, the locus of veneration to the collected qualities of the Tathāgata himself, whose nature is permanent, eternal, constant, and tranquil.

source: མེ་ཏོག་ཕྲེང་དང་། ཕྱེ་མའི་བསྒོ་བས་བསྒོས་པ་སྤྲིན་ཆེན་པོའི་མདོ་ནད་མེད་པར་བརྟེན་པའི་གཏེར་ཡི་གེར་བྲིས་ཤིག །
en: Perfumed with flowers and colored powders, The Great Cloud discourse is the treasury that supports freedom from disease. Thus you should copy its words.

source: སྤྲིན་ཆེན་སྙིང་པོ་སེམས་ཡོངས་སུ་རྨོངས་ཤིང་རྣམ་པར་འཁྲུལ་པ་རྣམས་དེ་བཞིན་གཤེགས་པ་མི་རྟག་ཅིང་ཐེར་ཟུག་པ་མ་ཡིན་ལ་མི་བརྟན་ཞིང་ནུབ་པར་འགྱུར་རོ་
en: “Great Cloud Essence, those whose minds are thoroughly clouded and confused will falsely claim that ‘the Tathāgata is not permanent and not eternal, and thus he is not constant and will disappear.’

source: ཞེས་ལོག་པར་སྨྲ་བ་རྣམས་མཁྲིས་པས་བརྒྱལ་ཞིང་དུག་གི་ཟུག་རྔུས་རྣམ་པར་བསྲེགས་པའི་ལྟ་བའི་གཉིད་ཀྱི་མུན་པས་གནོད་པར་བྱས་པའི་ཁྱིམ་དུ་ཉལ་ནས་གཉིད་ལོག་སྟེ།
en: They have been rendered unconscious by bile, and, struck by poisoned arrows, their vision has become dim.

source: རྨི་ལམ་མི་ཟད་པའི་ལྟ་བས་བསྲེགས་ནས་མྱོས་ཤིང་རྨིས་ཏེ་
en: Obscured by this darkness, they have fallen asleep in a decrepit house and are consumed by an unending dream, intoxicated by this dream state.

source: སྐྲག་པའི་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། བ་རྒན་གྲུམ་མོ་དང་འདྲ་བའི་སེམས་ཅན་རྣམས་ལ་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་གྱི་ཆེ་བ་ཉིད་རྟག་པའི་རང་བཞིན་ཤེས་པའི་འབྲུ་མར་དང་དེ་ཁོ་ན་རིག་པའི་སྙིང་པོ་རབ་ཏུ་འབར་བར་གྱིས་ཤིག །
en: You should light the blazing oil lamp of the essential awareness of reality and the enduring nature of the greatness of the Buddha’s qualities for sentient beings such as these, fretting śrāvakas and pratyekabuddhas who are like worn-out old cows.

source: དེ་བཞིན་གཤེགས་པའི་ཡོན་ཏན་གྱི་རང་བཞིན་རྟག་པའི་མར་མེ་ལ་འཇུག་པ་སྤངས་ནས་ཤཱཀྱའི་རིགས་ལ་བསྔགས་པ་མ་ཡིན་པ་བརྗོད་པའི་སེམས་ཅན་མི་ཤེས་པའི་ལྟ་བ་མང་བ་དེ་དག་ལ་དེ་ཁོ་ན་ཤེས་པའི་ཀ་ཏ་ཀའི་འབྲས་བུའི་མིག་སྨན་གྱིས་ཕྱི་བར་གྱིས་ཤིག །
en: You should apply the kataka-fruit medicine of reality to the eyes of those sentient beings who, having discarded the oil lamp of the permanent nature of the Tathāgata’s qualities, hold many ignorant views and say disparaging things about the Śākya family.

source: དེ་བཞིན་གཤེགས་པའི་རིགས་ཀྱི་ཆེ་བ་ཉིད་ཀྱི་ཡང་དག་པའི་ཡེ་ཤེས་སྤངས་ལ། དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་རབ་ཏུ་བྱུང་སྟེ་ཉེས་པ་རྗོད་པར་བྱེད་པ་དེ་དག་གི་ལྕེ་ཆོད་དེ་འོར་ཅིག །
en: You should protect those who, having abandoned the authentic gnosis of the greatness of the tathāgata family, proclaim that it is incorrect to follow the Tathāgata in going forth to renunciation and should thereby have their tongues cut out.

source: དེ་བཞིན་གཤེགས་པའི་ལྡེམ་པོ་ངག་ཤེས་རབ་ཀྱིས་རྟོགས་པར་བྱ་བའི་ཕྱིར་དེ་བཞིན་གཤེགས་པའི་རྗེས་སུ་རབ་ཏུ་བྱུང་སྟེ་
en: You should direct those who have used wisdom to comprehend the concealed intent of the Tathāgata, followed the Tathāgata in going forth to renunciation, and become children of the buddhas, guiding them to see all views as being like magical manifestations.

source: སངས་རྒྱས་ཀྱི་སྲས་སུ་གྱུར་པ་དེ་དག་ལ་ལྟ་བ་ཐམས་ཅད་ལ་རྣམ་པར་འཕྲུལ་པ་འདི་གཏད་པར་གྱིས་ཤིག །སྤྲིན་ཆེན་སྙིང་པོ་དེ་བཞིན་གཤེགས་པས་བཤད་པ་ལ་འབྲས་བུ་མེད་དོ་ཞེས་ཟེར་བའི་སེམས་ཅན་རྣམས་ལ་དེ་བཞིན་གཤེགས་པས་བཤད་པ་ལ་འབྲས་བུ་ཡོད་པར་མངོན་པར་རྟོགས་པར་བྱ་བའི་ཕྱིར་རྣམ་པར་འཕྲུལ་པར་གྱིས་ཤིག །
en: “Great Cloud Essence, for sentient beings who say that ‘in the Tathāgata’s teaching there is no result,’ you should miraculously emanate in order to cause them to directly realize that the Tathāgata’s teaching does have a result.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཁྱོད་ཀྱིས་རྙེད་པ་ལེགས་པར་རྙེད་ཀྱིས་མངོན་པར་དད་པར་གྱིས་ཤིག །
en: Great Cloud Essence, having obtained that which is well obtained, you should have deep faith.

source: སྤྲིན་ཆེན་སྙིང་པོ་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཐམས་ཅད་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྟ་བ་ཐམས་ཅད་སྐྱུག་པ་དང་། བཀྲུ་བ་དང་། སྨན་སྣར་བླུགས་པའི་ཆོ་ག་ཆེན་པོ་ཐམས་ཅད་ཀྱིས་ནད་ཆེན་པོ་རྣམས་གཞོམ་པའི་ཕྱིར་མཚུངས་པ་མེད་པའི་མདོའི་རྒྱལ་པོ་ཆེན་པོ། མདོ་ཐམས་ཅད་ཀྱི་བདག་པོ་འཁོར་ལོ་ཐམས་ཅད་བསྐོར་བ། དམ་པའི་ཆོས་རིན་པོ་ཆེའི་མཆོག་བརྟན་པའི་གཏེར། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡུལ་མ་ཡིན་པ།
en: Great Cloud Essence, because it destroys all the great illnesses by means of all the great procedures for applying various medicines in order to purge and cleanse the views of śrāvakas, pratyekabuddhas, and sentient beings, this unparalleled king of discourses, the lord of all discourses, the turning of all Dharma wheels, the steadfast treasury of the supreme jewel of the sacred Dharma, does not belong to the domain of sentient beings.

source: ཟབ་མོའི་ཚིག་གི་དོན་དེ་བཞིན་གཤེགས་པ་ལ་དྲིས་ལ། དམ་པའི་ཆོས་བརྟན་པའི་གཏེར་རབ་ཏུ་གནས་པར་གྱིས་ཤིག །
en: Having questioned the Tathāgata regarding the meaning of its profound words, you should abide fully by this steadfast treasury of the sacred Dharma.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོའི་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ལ་ལྟོས།
en: “Great Cloud Essence, you should view the domain of this Great Cloud discourse as inconceivable.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་རྣམ་པར་ཐར་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་གནས་པ་རིན་པོ་ཆེའི་མཛོད་ཀྱི་འབྱུང་གནས་ཀྱི་ཆོས་ཀྱི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཏིང་ངེ་འཛིན་གྱི་སྒོ་བཞི་བརྒྱ་ཡོད་དོ། །
en: Great Cloud Essence, in this Great Cloud discourse there are four hundred samādhi gateways called king of the magical manifestation of Dharma that is the source of the precious storehouse in which the tathāgatas and bodhisattvas abide in inconceivable liberation.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཕྱིར་མི་ཟློགས་པའི་ཡེ་ཤེས་མཐའ་ཡས་པའི་རིན་པོ་ཆེའི་འབྱུང་གནས་ལ་མངོན་པར་འཇུག་པ་ཞེས་བྱ་བའི་གཟུངས་ཀྱི་སྒོ་སུམ་ཅུ་རྩ་དྲུག་ཡོད་དོ། །
en: “Great Cloud Essence, in this Great Cloud discourse there are thirty-six dhāraṇī gateways called directly entering the jewel mine of the infinite gnosis of irreversibility of the tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ལྡེམ་པོ་ངག་གི་བཞིའི་བྱེ་བྲག་ལ་འཇུག་པ་ལ་རྨོངས་པའི་ཚུལ་ཅན་གྱི་ཆོས་ཀྱི་ཐབས་ཀྱི་རྒྱུན་གྱི་རྣམ་པར་ཐར་པའི་སྒོ་ཉི་ཤུ་རྩ་གསུམ་ཡོད་དོ། །
en: “Great Cloud Essence, within the inconceivable domain of this Great Cloud discourse there are twenty-three liberation gateways of the flow of skillful methods of Dharma for those who are ignorant of how to enter into the fundamental divisions of the concealed intent of the speech of tathāgatas and bodhisattvas.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་བསམ་གྱིས་མི་ཁྱབ་པའི་ཡུལ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྲིད་པར་སྐྱེ་བས་རྩེ་བའི་རྣམ་པ་ལ་འཇུག་ཅིང་གནས་པ་བགྲོད་པའི་གསང་བ་བཀོད་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within the inconceivable domain of this Great Cloud discourse there are ten Dharma gateways called king of the wondrous secret of the tathāgatas and bodhisattvas of the way to engage and abide in the playful appearance of taking birth in cyclic existence.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་འཁོར་བའི་ཉོན་མོངས་པའི་ཞིང་གི་ལས་ཀྱི་ས་ཐོབ་པར་བྱ་བའི་ཕྱིར་སེམས་ཀྱིས་ཡང་དག་པར་ལེན་པའི་རྣམ་པར་གྲོལ་བའི་སྨོན་ལམ་གསང་བ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called the secret aspiration to liberation, which the tathāgatas and bodhisattvas correctly take up with their minds in order to attain the karmic ground of the field of the afflictions of cyclic existence.

source: སྤྲིན་ཆེན་སྙིང་པོ་སྤྲིན་ཆེན་པོའི་མདོ་ལ་དེ་བཞིན་གཤེགས་པ་རྣམས་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་ཡེ་ཤེས་ལ་རྨོངས་པའི་སྙིང་པོ་བསམ་གྱིས་མི་ཁྱབ་པ་གཟུད་པའི་རྣམ་པར་འཕྲུལ་པའི་རྒྱལ་པོ་ཞེས་བྱ་བའི་ཆོས་ཀྱི་སྒོ་བཅུ་ཡོད་དོ། །
en: “Great Cloud Essence, within this Great Cloud discourse there are ten Dharma gateways called king of the magical manifestation that apprehends the inconceivable essence of ignorance regarding the gnosis of the tathāgatas and bodhisattvas.
